<details><summary>Digger run report at 2024-08-05 11:20:41 (UTC)</summary>
      <details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_kubernetes-addons has been locked by PR #10
</details>

<details><summary>Plan for <b>anzeha/floorball-fantasy-infra#staging_kubernetes-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # kubernetes_namespace.example1 will be created
  + resource "kubernetes_namespace" "example1" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "example-annotation1"
            }
          + generation       = (known after apply)
          + labels           = {
              + "mylabel" = "label-value1"
            }
          + name             = "terraform-example-namespace1"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  ```
</details>


<details><summary>Terraform plan validation check (staging_kubernetes-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>